{
  "header": {
    "home": "Αρχική",
    "about": "Σχετικά με εμένα",
    "projects": "Πρότζεκτ",
    "contact": "Επικοινωνία"
  },

  "main": {
    "name": "Στέφανος Παλαιοχωρίτης",
    "tag": "Προγραμματιστής, λάτρης του κώδικα!",
    "location": "Βασισμένος στην Αθήνα",
    "downloadCv": "Κατεβάστε το βιογραφικό μου!"
  },

  "details": {
    "info": {
      "heading": "Λίγα λόγια για εμένα",
      "content": "Έχω εργαστεί ως αστυνομικός για δέκα χρόνια και, τα τελευταία δύο χρόνια, προσπαθώ να δημιουργήσω ένα προφίλ προκειμένου να καταφέρω να μπω στον κόσμο του προγγραματσμού. Μέσα από την εργασία μου ως αστυνομικός, έχω αναπτύξει ισχυρή αίσθηση ομαδικότητας και προσαρμοστικότητας. Δίνω πολύ μεγάλη αξία στο σεβασμό που δείχνω στους γύρω μου και πάντα προσπαθώ για τη δημιουργία και διατήρηση ενός θετικού εργασιακού περιβάλλοντος. Σε βασικό επίπεδο, θεωρώ ότι έχω επάρκεια στη χρήση JavaScript/Typescript, καθώς και διαφόρων βιβλιοθηκών JavaScript όπως React,Svelte Vue, και ExpressJS. Είμαι σίγουρος για την ικανότητά μου να συνεισφέρω αποτελεσματικά ως μέλος μιας ομάδας και ανυπομονώ να αξιοποιήσω τις δεξιότητές μου."
    },
    "futureGoals": {
      "heading": "Μελλοντικά σχέδια",
      "content": "Σε πέντε χρόνια, φιλοδοξώ να είμαι ένας έμπειρος και καταξιωμένος επαγγελματίας στον κλάδο, συνεισφέροντας σε μια εταιρεία με όραμα στο οποίο πιστεύω βαθιά—μια εταιρεία, που καλλιεργεί ένα υγιές και υποστηρικτικό εργασιακό περιβάλλον. Στόχος μου είναι να εφαρμόζω και να βελτιώνω τις δεξιότητές μου με ουσιαστικούς τρόπους, επιτυγχάνοντας ένα αίσθημα ολοκλήρωσης και διαρκούς εξέλιξης, τόσο προσωπικά όσο και επαγγελματικά."
    },
    "interviewTakeaway": {
      "heading": "Τι πήρα από τη συνέντευξη",
      "content": "Αυτό που μου έκανε ιδιαίτερη εντύπωση κατά τη διάρκεια της συνέντευξης ήταν η προσέγγιση της Web Eleven, που αντιμετωπίζει κάθε επιχείρηση σαν έναν ζωντανό οργανισμό, προσφέροντας τη φροντίδα και τους πόρους που χρειάζονται για να ανθίσει, πλήρως ευθυγραμμισμένο με το εμπνευσμένο μότο της εταιρείας, «Make it bloom». Εκτίμησα επίσης ιδιαίτερα τη σημασία που δίνει στις ανάγκες των εργαζομένων, δίνοντας έμφαση στις ανάγκες τους, κάτι που προάγει την παραγωγικότητα και την ισορροπία."
    }
  },

  "projects": [
    {
      "title": "Regional Pricing API",
      "techStackHeading": "Τεχνολογίες",
      "description": "Το αντικείμενο αυτού του έργου ήταν η υλοποίηση ενός web API που, δεδομένης μιας διεύθυνσης IP, καθορίζει την τιμολόγηση των υπηρεσιών της Moby IT. Η εφαρμογή αποθηκεύει προσωρινά έναν χάρτη IP-σε-χώρα χρησιμοποιώντας το Redis και χρησιμοποιεί μια εξωτερική υπηρεσία για να προσδιορίσει τη χώρα του χρήστη.",
      "techStack": ["Deno"],
      "link": "https://github.com/moby-it/regional-pricing"
    },
    {
      "title": "Gaming Grids",
      "techStackHeading": "Τεχνολογίες",
      "description": "Το Gaming Grids είναι ένα παιχνίδι immaculate grid που βασίζεται σε ένα 3x3 παζλ  και έχει θεματολογία από το League of Legends. Οι κανόνες είναι ίδιοι με αυτούς κάθε immaculate grid, αλλά οι περιορισμοί και τα αποτελέσματα σχετίζονται με τους ήρωες του προαναφερθέντος Brand. Το έργο βρίσκεται ακόμα σε εξέλιξη και αναπτύσσεται σε συνεργασία με τον Γιώργο Σπανό και τον Faraz Barbar.",
      "techStack": ["Nuxt", "Supabase"],
      "link": "https://github.com/moby-it/gaming-grids"
    },
    {
      "title": "Frontend-MovieRama",
      "techStackHeading": "Τεχνολογίες",
      "description": "Το MovieRama είναι μια διαδικτυακή εφαρμογή που αντλεί και προβάλλει δεδομένα ταινιών από το API του The Movie Database (TMDB). Η εφαρμογή επιτρέπει στους χρήστες να βλέπουν ταινίες που παίζονται αυτή τη στιγμή στους κινηματογράφους, να αναζητούν συγκεκριμένες ταινίες, να φορτώνουν την επόμενη σελίδα ταινιών με τη χρήση infinite scrolling και να βλέπουν λεπτομερείς πληροφορίες για μεμονωμένες ταινίες, συμπεριλαμβανομένων σχετικών βίντεο, κριτικών και παρόμοιων ταινιών.",
      "techStack": ["html", "css", "typescript"],
      "link": "https://github.com/Armaroth/frontend-MovieRama-Stef_Palaiochoritis"
    }
  ],

  "contact": {
    "heading": "Επικοινωνήστε μαζί μου",
    "labels": {
      "name": "Όνομα",
      "email": "Ηλεκτονική διεύθυνση",
      "message": "Μήνυμα"
    },
    "button": "Αποστολή"
  }
}
